var data = [{
				name: "四川",
				next: [{
					name: '成都1',
					next: ["东站1", "北站2", "南站3"]
				}, {
					name: '成都2',
					next: ["东站4", "北站5", "南站6", "东站7", "北站8", "南站9"]
				}, {
					name: '成都3',
					next: ["东站11", "北站12"]
				}]
			}, {
				name: "云南",
				next: [{
					name: '云南1',
					next: ["东站13", "北站14", "南站15"]
				}, {
					name: '云南2',
					next: ["东站16", "北站17", "南站18", "东站19", "北站21", "南站22"]
				}, {
					name: '云南3',
					next: ["东站23", "北站24"]
				}, {
					name: '云南4',
					next: ["东站25", "北站26", "南站27"]
				}, {
					name: '云南5',
					next: ["东站23", "北站33", "南站34", "东站35", "北站36", "南站37"]
				}, {
					name: '云南6',
					next: ["东站41", "北站42"]
				}]
			},{
				name: "dnf",
				next: [{
					name: '四川',
					next: ["一区", "二区", "三区","四区",'五区',"六区"]
				}, {
					name: '北京',
					next: ["1区", "2区"]
				}, {
					name: '山东',
					next: ["壹区", "贰区","叁区","肆区"]
				}]
			}]
